# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\user\Desktop\UltraSonic180715.cydsn\uzaklik.cydsn\uzaklik.cyprj
# Date: Thu, 01 Apr 2021 12:04:44 GMT
#set_units -time ns
create_clock -name {Clock_12MHz(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {UART_SCBCLK(FFB)} -period 708.33333333333326 -waveform {0 354.166666666667} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_12MHz} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 17 35} -nominal_period 708.33333333333326 [list]


# Component constraints for C:\Users\user\Desktop\UltraSonic180715.cydsn\uzaklik.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\user\Desktop\UltraSonic180715.cydsn\uzaklik.cydsn\uzaklik.cyprj
# Date: Thu, 01 Apr 2021 12:04:40 GMT
